# HorizontalFlip Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..HorizontalFlip Method
HostedSweep Class See Also
---
Flip the hosted sweep object along horizontal line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void HorizontalFlip()
```

Visual Basic
---
```text
Public Sub HorizontalFlip
```

Visual C++
---
```text
public:
void HorizontalFlip()
```

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace